blog/2013-09-28-linkfest.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Weekend Linkfest 28.9.2013 - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="Statistics and Machine Learning imMens: Real-time Visual Querying of Big Data Points of Significance: Error bars atascience@berkeley Utilities &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Weekend Linkfest 28.9.2013</h2>
	<div class="entry-content"><div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Statistics and Machine Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://vis.stanford.edu/projects/immens/">imMens: Real-time Visual Querying of Big Data</a>
</li>
<li><a href="http://www.nature.com/nmeth/journal/v10/n10/full/nmeth.2659.html">Points of Significance: Error bars</a>
</li>
<li><a href="http://requestinfo.datascience.berkeley.edu/index.html?s=twitterppc&l=1gds_ht_tl_gen1&utm_source=twitterppc&utm_medium=link&utm_campaign=1gds_ht_tl_gen1">atascience@berkeley</a>
</li>
<li><a href="http://www.forbes.com/sites/jeffmcmahon/2013/09/25/utilities-dumbstruck-by-big-data-from-smarter-grid/">Utilities Dumbstruck By Big Data From Smarter Grid</a>
</li>
<li><a href="http://svonava.com/post/62186512058/datasets-released-by-google">Datasets released by Google</a>
</li>
<li><a href="http://www.technologyreview.com/news/519411/facebook-launches-advanced-ai-effort-to-find-meaning-in-your-posts/">Facebook Chases Google’s Deep Learning with New Research Group</a>
</li>
<li><a href="https://vimeo.com/75358652">Discovering Hidden Structure in Data with Latent Variable Models in Python on</a>
</li>
<li><a href="http://mloss.org/revision/view/1404/">LIBOL is an open-source library for large-scale online classification</a>
</li>
<li><a href="http://www.nature.com/srep/2013/130207/srep01236/full/srep01236.html">Extracting insights from the shape of complex data using topology</a>
</li>
<li><a href="http://dl.acm.org/citation.cfm?id=2391072">Monte Carlo MCMC: efficient inference by approximate sampling</a>
</li>
<li><a href="http://blog.mikiobraun.de/2013/09/designing-machine-learning-frameworks.html">Designing ML frameworks</a>
</li>
<li><a href="https://github.com/JasperSnoek/spearmint">Spearmint is a package to perform Bayesian optimization</a>
</li>
<li><a href="http://simplystatistics.org/2013/09/17/announcing-the-simply-statistics-unconference-on-the-future-of-statistics-futureofstats/">Announcing the Simply Statistics Unconference on the Future of Statistics #futureofstats</a>
</li>
<li><a href="http://www.chrisstucchio.com/blog/2013/bayesian_bandit.html">Bayesian Bandits - optimizing click throughs with statistics</a>
</li>
<li><a href="http://errorstatistics.com/2013/09/14/when-bayesian-inference-shatters-owhadi-scovel-and-sullivan-guest-post/">“When Bayesian Inference Shatters” Owhadi, Scovel, and Sullivan</a>
</li>
<li><a href="http://statsatlmu.tumblr.com/post/61393875021/penalized-likelihood-and-bayesian-function-selection-in">Penalized likelihood and Bayesian function selection in regression models</a>
</li>
<li><a href="http://www.cs.toronto.edu/~hinton/absps/guideTR.pdf?utm_source=buffer&utm_campaign=Buffer&utm_content=buffer2f66c&utm_medium=twitter">A Practical Guide to Training Restricted Boltzmann Machines</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">R Package of the Week</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://blog.mckuhn.de/2013/09/introducing-parallelrandomforest-faster.html">Introducing parallelRandomForest: faster, leaner, parallelized</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Paper of the Week</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://arxiv.org/abs/1309.6865">Modeling Documents with Deep Boltzmann Machines</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Programming</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://blog.mortardata.com/post/61501767090/hadoop-for-data-science">Hadoop for Data Science (Slides &amp; Video) | Mortar Blog</a>
</li>
<li><a href="http://www.chrisstucchio.com/blog/2013/hadoop_hatred.html">Don&#8217;t use Hadoop - your data isn&#8217;t that big</a>
</li>
<li><a href="http://adv-r.had.co.nz/">Advanced R Programming</a>
</li>
<li><a href="http://jeroenjanssens.com/2013/09/19/seven-command-line-tools-for-data-science.html">7 command-line tools for data science</a>
</li>
<li><a href="http://gastonsanchez.wordpress.com/2013/09/22/handling-and-processing-strings-in-r/">Handling and Processing Strings in R</a>
</li>
<li>Video: <a href="https://thenewcircle.com/s/post/1540/a_billion_rows_per_second_metaprogramming_python_for_big_data_ville_tuulos_video">A Billion Rows per Second: Metaprogramming Python for Big Data</a> Slides: <a href="http://tuulos.github.io/sf-python-meetup-sep-2013/#/">Metaprogramming Python for Big Data</a>
</li>
<li><a href="https://github.com/olgabot/prettyplotlib">Prettyplitlib for good looking matplotlib plots</a>
</li>
<li><a href="http://gigaom.com/2013/09/25/databricks-raises-14m-from-andreessen-horowitz-wants-to-take-on-mapreduce-with-spark/">Databricks raises $14M from Andreessen Horowitz, wants to take on MapReduce with Spark</a>
</li>
<li><a href="http://blog.revolutionanalytics.com/2013/09/r-302-frisbee-sailing-now-available.html">R 3.0.2 &#8220;Frisbee Sailing&#8221; now available</a>
</li>
<li><a href="http://www.chrisstucchio.com/blog/2013/why_not_python.html">Why Not Python - the GIL hinders concurrency</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Elsewhere</h2>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-09-28T00:00:00+02:00" pubdate data-updated="true">Sep 28<span>th</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/linkfest/'>Linkfest</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2014

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>